{"_id":{"$oid":"58e21c4e7fc4e10ddd1fb9d7"},"updatedAt":{"$date":"2017-04-03T10:21:51.894Z"},"createdAt":{"$date":"2017-04-03T09:56:30.439Z"},"title":"title","content":"console.log('hey')","__v":0}
{"_id":{"$oid":"58e21dda7fc4e10ddd1fb9d9"},"updatedAt":{"$date":"2017-04-03T10:15:14.620Z"},"createdAt":{"$date":"2017-04-03T10:03:06.981Z"},"title":"hack","content":"document.querySelector('h1').innerHTML = \"You've got hacked\";","__v":0}
{"_id":{"$oid":"5908aa02e6e82a1c2fa19055"},"updatedAt":{"$date":"2017-05-02T15:47:14.951Z"},"createdAt":{"$date":"2017-05-02T15:47:14.951Z"},"title":"test","content":"avec des truc dedans","__v":0}
{"_id":{"$oid":"590988d6ef50a60fe9373de5"},"updatedAt":{"$date":"2017-05-03T07:37:58.368Z"},"createdAt":{"$date":"2017-05-03T07:37:58.368Z"},"title":"Les identifiants de connexion","content":"mail: jorisdamien@gmail.com\nmdp : thematrix\n\nCe qu’est un fork Github ?\nUn fork Github permet de recopier entierement un projet dans son repo personel.\n\nA quoi sert-il ?\nIl permet de pouvoir modifier a sa guise un projet déjà existant.\n\nQu’est-ce qu’une pull request ? Quel est l’intérêt ?\nUne pull request est une demande de modification / amélioration sur un projet. L'intérêt c'est de pouvoir participer a un projet en permettant une verification par les pairs. Tant que les modif ne sont pas validés, la pull request n'est pas ajouté au projet.\n\nQu’est-ce qu’une branche ?\nUne branche git c'est un endroit unique ou des modification peuvent être faite sans impacter d'autres branche. Ca permet de travailler séparement de la branche de production par exemple.\n\nQuelle est la différence entre une branche et un fork ?\nUne branche est a l'interieur du projet, un fork est une copie exterieure du projet","__v":0}
{"_id":{"$oid":"59099a472835a414dd504cfd"},"updatedAt":{"$date":"2017-05-03T08:52:23.215Z"},"createdAt":{"$date":"2017-05-03T08:52:23.215Z"},"title":"La MEAN stack","content":"Angular :\nAngular est un framework front qui utilise le modèle MVC (Model, Vue, Controller) et le model SPA (Single Page App).  Il permet de simplifier le développement d’une application.\nElle sera utilisé côté Front.\nIl fait parti de la MEAN stack donc est obligatoire pour ce projet.\n\nAngular UI Router\nIl permet de gerer les etats de l’application.On pourrait utiliser angular route pour le projet a la place de ui router mais on ne pourrait pas se passer de cette techno. Il agit en front.\n\nExpress\nC’est un framework nodejs. Il simplifie la gestion des routes côté serveur. Pour un projet mean stack il est obligatoire (E de MEAN).\n\nJSONWebToken\nIl permet d’autoriser un utilisateur a se connecter si il possede un jeton de connexion. Technologie front. Il est obligatoire quand un utilisateur doit se connecter.\n\nMongoose\nC’est un serveur web, il permet d’aller interroger une base de donnée et de gerer des schema de données. Il sert de passerelle entre mongodb et nodejs. Il est obligatoire pour ce projet, c’est une techno back.\n\nMaterializeCSS\nC’est un framework css front. Je ne sais pas si il est obligatoire pour le projet, mais il a l’air cool.\n\nPassport\nC’est un middelware nodejs qui permet de gérer les authentifications, surtout pour les oAuth avec facebook ou google par exemple. Il est sur le back de l’application.\n\nBabel\nIl gere la compatibilité des langages avec les différents navigateur. C’est une techno front et back obligatoire pour le projet.\n\nSCSS\nC’est un lanage de generation de feuille de style.\n\nNodemon\nIl permet de rechager l’application a chaque fois qu’une modif est faite dans le code backend. Pas obligatoire.\n\nWebpack\nIl permet de réorganiser sont application en modules JS. C’est une techno front et back, obligatoire pour les nombreux fichier JS du projet.\n\nLivereload \nPermet le rechargement de la page a chaque fois qu’une modif dans des fichier front est effectuées. C’est un mini serveur web, il agit en back et front. Pas obligatoire.\n\n\n\nLa MEAN Stack c’est le regroupement de MongoDb, ExpressJS, Angular, NodeJS. C’est le package qui permet de faire toute une application web avec le meme langage Javascript.","__v":0}
{"_id":{"$oid":"5909cfce2eec675a29f4f8f8"},"updatedAt":{"$date":"2017-05-03T12:40:46.450Z"},"createdAt":{"$date":"2017-05-03T12:40:46.450Z"},"date":{"$date":"2017-05-25T00:00:00.000Z"},"title":"Test envoi date","content":"Est ce que la date sera envoyé en BDD ?","__v":0}
{"_id":{"$oid":"5909e4b46b3ab66bc610abb3"},"updatedAt":{"$date":"2017-05-03T14:09:56.049Z"},"createdAt":{"$date":"2017-05-03T14:09:56.049Z"},"date":{"$date":"2017-05-20T00:00:00.000Z"},"title":"sgg","content":"sgsfgg","published":true,"__v":0}
{"_id":{"$oid":"5909e4c46b3ab66bc610abb4"},"updatedAt":{"$date":"2017-05-03T14:10:12.328Z"},"createdAt":{"$date":"2017-05-03T14:10:12.328Z"},"date":{"$date":"2017-05-25T00:00:00.000Z"},"title":"wsgwdf","content":"wdfgfdg","__v":0}
